import { useState, useEffect } from 'react'
import { useSelector, useDispatch } from 'react-redux'
import { toggleRules, toggleRulesAccepted } from 'redux/appReducer'

export default function Rules() {
  const { showRules, rulesAccepted } = useSelector((state) => state.app)
  const dispatch = useDispatch()
  const [animation, setAnimation] = useState('bounceInUp')
  const hideRules = () => {
    setAnimation('bounceOutDown')
    setTimeout(dispatch, 500, toggleRules())
  }
  const acceptRules = () => {
    hideRules()
    setTimeout(dispatch, 1000, toggleRulesAccepted())
  }

  useEffect(() => {
    setAnimation(showRules ? 'bounceInUp' : 'bounceOutDown')
  }, [showRules])

  return (
    <div className={`rules-wrapper animate ${animation}`}>
      <div className="rules-text white pb-3">
        <h1>
          ПОРЯДОК ДІЇ АКЦІЇ
          <br />
          &laquo;Завантажуй та грай&raquo;
        </h1>
        <h2>1. ОРГАНІЗАТОР АКЦІЇ</h2>
        <p>
          1.1. Організатором Акції &laquo;Завантажуй та грай!&raquo; (далі
          &ndash; Акція) є ТОВ &laquo;Епіцентр&nbsp;К&raquo; (далі &ndash;
          Товариство), юридична адреса: 02139, м.&nbsp;Київ,
          вул.&nbsp;Берковецька, 6-К.
        </p>
        <p>
          1.2. Організатор не несе відповідальності за не ознайомлення учасника
          Акції з правилами даного Порядку.
        </p>
        <p>
          1.3 Участь в Акції означає повну згоду її Учасника з усіма умовами.
          Інформування щодо правил та умов проведення Акції здійснюється шляхом
          розміщення цього Порядку у мобільному додатку Епіцентр&nbsp;К.
        </p>
        <p>
          1.4. Картка програми лояльності &laquo;Вигода&raquo; діє в Товаристві
          на підставі затверджених наказом генерального директора &laquo;Правил
          участі у програмі лояльності &laquo;Вигода&raquo;, далі &ndash;
          Картка&nbsp; програми лояльності &laquo;Вигода&raquo;, що розміщені на
          сайті Товариства: <i>vygoda.epicentrk.ua</i>
        </p>
        <h2>2. ПЕРІОД ТА ТЕРИТОРІЯ ДІЇ АКЦІЇ</h2>
        <p>
          2.1. Період дії Акції: з 15 травня по 15 червня 2021 року включно (або
          до вичерпання призового фонду).
        </p>
        <p>
          2.2. Акція діє на всій території України для користувачів мобільного
          додатку Епіцентр&nbsp;К, які виконали всі умови Акції.
        </p>
        <h2>3. МЕТА ПРОВЕДЕННЯ АКЦІЇ</h2>
        <p>
          3.1. Метою Акції є популяризація мобільного додатку Епіцентр&nbsp;К
          серед потенційних покупців та залучення покупців до здійснення покупок
          в мережі торговельних центрах &laquo;Епіцентр&raquo; та інтернет
          магазині <i>epicentrk.ua</i>.
        </p>
        <h2>4. ПРЕДМЕТ ТА УМОВИ УЧАСТІ В АКЦІЇ</h2>
        <p>
          4.1. Предметом Акції є право учасників отримати знижку на наступні
          покупки в мережі ТЦ &laquo;Епіцентр&raquo;, що розташовані в м. Києві
          та регіонах України, а також є невідокремленими структурними
          підрозділами Товариства та у інтернет-магазині <i>epicentrk.ua</i>, у
          вигляді нарахування балів на картку програми лояльності
          &laquo;Вигода&raquo; ТОВ &laquo;Епіцентр&nbsp;К&raquo; (далі - бали)
          на умовах цього Порядку. Загальний фонд акції складає{' '}
          <b className="bold">10&nbsp;000&nbsp;000</b> балів.
        </p>
        <p>
          4.2. До участі в Акції запрошуються всі дієздатні громадяни України,
          які завантажили мобільний додаток Епіцентр&nbsp;К до початку Акції та
          ті, хто завантажив в період Акції, є учасниками програми лояльності
          &ldquo;ВИГОДА&rdquo; та які в період дії акції виконали всі умови
          Акції.
        </p>
        <p>
          4.3. Акція проводиться серед усіх користувачів мобільного додатку ,
          які виконали всі умови Акції.
        </p>
        <p>
          4.4. Для участі в Акції будь-яка фізична особа (див. п. 4.2.), в
          період з 15.05.2021 до 15.06.2021 має виконати усі наступні умови:
        </p>
        <p>
          - авторизуватись у мобільному додатку або завантажити мобільний
          додаток Епіцентр&nbsp;К;
          <br />- зазначити стать, вік та соціальну мережу на сторінці Акції
          <br />- запросити 5 друзів з контактів на сторінку Акції
        </p>
        <p>
          Після виконання усіх зазначених умов покупець має 1 можливість та 3
          спроби отримати акційні бали на відповідному таблі, згідно з сумарним
          номіналом 3-ох спроб. По результату такий покупець отримує СМС/Viber
          повідомлення, з інформацією про кількість нарахованих балів, що
          свідчить про набуття ним статусу учасника Акції. Організатор не несе
          відповідальності за неможливість доставки СМС/Viber повідомлення
          покупцеві з причин, що не залежать від волі Організатора.
        </p>
        <p>
          В рамках акції &ldquo;Завантажуй та грай&rdquo; учасник має можливість
          отримати знижку на наступну покупку в мережі ТЦ &laquo;Епіцентр&raquo;
          та у інтернет-магазині <i>epicentrk.ua</i>. у вигляді нарахування
          балів (бали) на картку програми лояльності &laquo;Вигода&raquo; ТОВ
          &laquo;Епіцентр&nbsp;К&raquo;. В іншому випадку, якщо покупець не
          виконав будь-яку з умов, покупець втрачає право на участь в Акції.
        </p>
        <p>
          Нарахування балів, отриманих в рамках Акції, на картку програми
          лояльності &laquo;Вигода&raquo; учаснику відбувається в момент
          отримання СМС/Viber повідомлення. Право на придбання товарів з
          використанням балів, отриманих в рамках Акції, надається Учаснику,
          починаючи з&nbsp; наступного дня з дня отримання СМС/Viber
          повідомлення. Порядок використання балів визначено Правилами участі у
          програмі лояльності &laquo;Вигода&raquo;, що розміщені на сайті
          Товариства: <i>vygoda.epicentrk.ua</i>, з урахуванням особливостей,
          визначених Порядком дії цієї Акції.
        </p>
        <p>
          4.5. Загальний фонд встановлюється Організатором Акції в
          односторонньому порядку та обговоренню з учасниками Акції не підлягає.
        </p>
        <p>
          4.6. Кількість разів участі в Акції &ndash; обмежена, 1 шанс 3 спроби.
        </p>
        <p>
          4.7. Порушення Учасником будь-яких умов цього Порядку дії Акції, або
          відмова Учасника Акції від належного виконання цього Порядку
          вважається відмовою Учасника Акції від участі в Акції.
        </p>
        <p>
          4.8. При відмові учасника від участі в Акції відповідно п. 4.8 цього
          Порядку, Акція вважається такою, що не відбулася і такий учасник не
          отримає знижку та будь яку компенсацію
        </p>
        <h2>5. ІНШІ УМОВИ</h2>
        <p>
          5.1. Організатор Акції має право в односторонньому порядку доповнити
          або змінити цей Порядок. Зміни та доповнення до Порядку здійснюються
          шляхом їх внесення до тексту Порядку, розміщеного у мобільному додатку
          Епіцентр&nbsp;К.
        </p>
        <p>
          5.2. Організатор не несе відповідальності за дії органів державної
          влади та інші незалежні від нього обставини, які можуть зробити
          неможливим виконання умов Акції.
        </p>
        <p>
          5.3. Організатор не несе відповідальності у разі настання обставин
          непереборної сили таких, як стихійні лиха, пожежі, паводки, воєнні дії
          будь-якого характеру, блокади, суттєві зміни у чинному законодавстві,
          яке діє на території України, інші незалежні від волі Організатора
          Акції обставини, що перешкоджають в проведенні Акції та впливають на
          її результати.
        </p>
        <p>
          5.4. Своєю участю в Акції всі Учасники Акції підтверджують свою згоду
          на безкоштовне використання свого імені і прізвища Організатором
          Акції, на проведення фото-та/або кінозйомки (відеозйомки) за їх участю
          в рамках Акції без будь-якого відшкодування, а також підтверджують і
          надають згоду на те, що їх імена та фотографії можуть бути оголошені
          та використані організатором безкоштовно в будь-яких друкованих,
          аудіо- та відеоматеріалах, які стосуються Акції, з рекламною метою
          способом і методами, що не суперечать чинному законодавству України.
        </p>
        <p>
          5.5. Організатор Акції не несе відповідальності за неможливість
          отримання балів у зв&rsquo;язку з будь-якими обставинами, що
          знаходяться поза межами контролю Організатора (відсутність необхідних
          документів тощо).
        </p>
        <p>
          5.6. Під час проведення Акції чи після її закінчення, Організатор не
          зобов&rsquo;язаний вести переписку з учасниками Акції та надавати
          пояснення в усній чи письмовій формі з питань, що стосуються умов
          проведення, визначення осіб, що отримують бали на умовах Акції чи
          будь-яких подібних питань щодо Акції.
        </p>
        <p>
          5.7. У разі виникнення ситуації, що допускає неоднозначне тлумачення
          цього Порядку, і/або спірних питань та/або питань, неврегульованих цим
          Порядком, остаточне рішення приймається Організатором. Рішення
          організатора є остаточним.
        </p>
        <p>
          5.8. Своєю участю в Акції Учасники Акції підтверджують повну згоду з
          усіма викладеними умовами, а також зобов&rsquo;язуються їх виконувати.
        </p>
        <p>
          5.9. З правилами дії Акції можна ознайомитися на сторінці Акції у
          мобільному додатку Епіцентр&nbsp;К.
        </p>
      </div>
      <div className="rules-controls-wrapper">
        <div className="rules-controls d-flex light-blue">
          <div className="form-submit close cursor-pointer" onClick={hideRules}>
            <div className="btn">Закрити</div>
          </div>
          {!rulesAccepted && (
            <div className="form-submit">
              <div className="btn active nowrap" onClick={acceptRules}>
                Приймаю правила
              </div>
            </div>
          )}
        </div>
      </div>
    </div>
  )
}
